app/controllers/championships_controller.rb

  def index
    #@championships = Championship.find_all_by_user_id(session[:user_id])
    @championships = Championship.paginate :page => params[:page], :per_page => 4,
                                          :conditions => {:user_id => session[:user_id]}
---
SELECT * FROM `championships` WHERE (`championships`.`user_id` = 1)

  def show
    @championship = Championship.find(params[:id])
---
SELECT * FROM `championships` WHERE (`championships`.`id` = 1)

  def edit
    begin
      @championship = Championship.find(params[:id], :conditions => {:user_id => session[:user_id]})
---
SELECT * FROM `championships` WHERE (`championships`.`id` = 2 AND (`championships`.`user_id` = 1))

  def create
    @championship = Championship.new(params[:championship])

    respond_to do |format|
      #if @championship.save
      if @user_logged.championships << @championship
---
INSERT INTO `championships` (`name`, `number_teams`, `match_type`, `created_at`, `image_url`, `updated_at`, `user_id`, `description`) VALUES('Campeonato Mineiro', 4, 1, '2010-08-29 11:35:58', 'http://t2.gstatic.com/images?q=tbn:vmsu0Z1Itgq6-M:http://img26.imageshack.us/img26/669/mineiro2010.jpg', '2010-08-29 11:35:58', 1, 'descricao')

  def destroy
    begin
      @championship = Championship.find(params[:id], :conditions => {:user_id => session[:user_id]})
      @championship.destroy
---
SELECT * FROM `championships` WHERE (`championships`.`id` = 4 AND (`championships`.`user_id` = 1))
DELETE FROM `championships` WHERE `id` = 4