app/controllers/login_controller.rb

  def index
    @total_championships = Championship.count
---
SELECT count(*) AS count_all FROM `championships`