app/controllers/main_controller.rb

SELECT * FROM `championships`
---
  def index
    @championships = Championship.find_championships_for_home params[:page]