app/controllers/teams_controller.rb

SELECT * FROM `championships` WHERE (`championships`.`id` = 1)
---
  def index
    @championship = Championship.find(params[:championship_id])

SELECT * FROM `teams` WHERE (`teams`.`id` = 0)
---
  def show
    @team = Team.find(params[:id])

SELECT * FROM `championships` WHERE (`championships`.`id` = 5 AND (`championships`.`user_id` = 1))
SELECT count(*) AS count_all FROM `teams` WHERE (`teams`.championship_id = 1)
---
  def new_teams
    begin
      @championship = Championship.find(params[:id], :conditions => {:user_id => session[:user_id]})
      if @championship.teams.size > 0

SELECT * FROM `teams` WHERE (`teams`.`id` = 1)
---
  def edit
    @team = Team.find(params[:id])

SELECT * FROM `championships` WHERE (`championships`.`id` = 1 AND (`championships`.`user_id` = 1))
SELECT count(*) AS count_all FROM `teams` WHERE (`teams`.championship_id = 2)
INSERT INTO `teams` (`name`, `championship_id`, `created_at`, `updated_at`) VALUES('Palmeiras', 1, '2010-09-03 05:42:38', '2010-09-03 05:42:38')
---
  def create_teams
    @championship = Championship.find(params[:championship_id], :conditions => {:user_id => session[:user_id]})
    teams = params[:teams]
    if teams.size == (@championship.number_teams - @championship.teams.size)
      teams.each do |t|
        @championship.teams << Team.new(:name => t)

SELECT * FROM `teams` WHERE (`teams`.`id` = 8)
UPDATE `teams` SET `updated_at` = '2010-09-03 06:08:28', `name` = 'PalmeirasB' WHERE `id` = 1
---
  def update
    @team = Team.find(params[:id])

    respond_to do |format|
      if @team.championship.user_id == session[:user_id] and @team.update_attributes(params[:team])