app/controllers/users_controller.rb

SELECT * FROM `users` WHERE (`users`.`id` IS NULL) LIMIT 1
---
  def index
    @users = User.find(:all, :order => :name)

INSERT INTO `users` (`name`, `salt`, `created_at`, `updated_at`, `hashed_password`, `login`) VALUES('Kleber Infante', '-6174440580.6538393430964', '2010-08-24 05:17:28', '2010-08-24 05:17:28', 'd62ba670799c6de1707b77f11b345d86bd9ac0e2a84aba1dc30ed1db05a9e242', 'kinfante')
---
  def create
    @user = User.new(params[:user])

    respond_to do |format|
      if @user.save

SELECT * FROM `users` WHERE (`users`.`id` = 1)
DELETE FROM `users` WHERE `id` = 1
---
  def destroy
    @user = User.find(params[:id])
    begin
      @user.destroy