app/controllers/users_controller.rb

  def index
    #@users = User.find(:all, :order => :name)
    @users = User.paginate :page => params[:page], :order => :name, :per_page => 4
---
SELECT * FROM `users` ORDER BY name